Resets the iterator to the initial state.
  Namespace:   Autodesk.Revit.DB.Macros
  Assembly:   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public virtual void Reset()
  Visual Basic
Public Overridable Sub Reset
  Visual C++
public:
virtual void Reset()
 See Also
  MacroManagerIterator Class
  Autodesk.Revit.DB.Macros Namespace